SOAP UI/01_Calculator_Demo_SOAP Project/TestSuite1 ( Postivie workflow )_05-05-2023_094539.html

<html><head><style>.tooltip{position:absolute;margin:5px;width:200px;height:50px;border:1px solid black;display:none;background-color: #FFFFFF}</style><script>function showTool(objectID){ var theElementStyle = document.getElementById(objectID);theElementStyle.style.display = "block";}function hideTool(objectID){ var theElementStyle = document.getElementById(objectID);theElementStyle.style.display = "none";}</script><script type="text/javascript" src="https://www.google.com/jsapi"></script><script type="text/javascript">google.load('visualization', '1.0', {'packages':['corechart']});  google.setOnLoadCallback(drawChart);function drawChart() {var data = new google.visualization.DataTable(); data.addColumn('string', 'Result'); data.addColumn('number', 'Count');data.addRows([['PASS', 4],['FAIL', 0],]); var options = {'title':'Overall Result', 'width':500, 'height':300, 'backgroundColor':'fefefe', 'colors': ['#009933', '#F00000'], 'fontSize': 15};var chart = new google.visualization.PieChart(document.getElementById('chart_div'));chart.draw(data, options);}</script><title>TestSuite1 ( Postivie workflow ) Automation Report</title></head><script> function showDiv(objectID) { var theElementStyle = document.getElementById(objectID);  if(theElementStyle.style.display == "none")  { theElementStyle.style.display = "block";  } else { theElementStyle.style.display = "none"; }  }</script><body bgcolor="#FFFAFA"><h1 align="center">TestSuite1 ( Postivie workflow ) Automation Report</h1><div id="chart_div" style="float:left"></div><br><br><table width="35%" border="1" margin="10,5,5,50"  align="center"><tr width="100%" align="left"><th bgcolor="#fefefe" width="50%">Total API cases Executed</th><th bgcolor="#fefefe" width="50%">4</th></tr><tr width="100%" align="left"><th bgcolor="#fefefe" width="50%">Total Cases Passed</th><th bgcolor="#fefefe" width="50%">4</th></tr><tr width="100%" align="left"><th bgcolor="#fefefe" width="50%">Total Cases Failed</th><th bgcolor="#fefefe" width="50%">0</th></tr><tr width="100%" align="left"><th bgcolor="#fefefe" width="50%">Environment</th><th bgcolor="#fefefe" width="50%">http://www.dneonline.com/calculator.asmx</th></tr><tr width="100%" align="left"><th bgcolor="#fefefe" width="50%">Execution Time</th><th bgcolor="#fefefe" width="50%">05-05-2023 09:45:39 am</th></tr></table><table align="center" width="80%" class="Report"  bgcolor="#ADE6F1" border="1" margin="10,5,5,50"><tr><th width="80%">Test Execution Results</th></tr></table><TABLE align="center" ID="One" class= "class_name" bgcolor="#65C400" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "10%" align="center" ><font color="white">Add TestCase</font></TD><TD width = "50%" onClick="showDiv('targetAdd TestCase');return false;" ><font color="white">Add TestCase</font></td></TR></TABLE><div id="targetAdd TestCase" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#E5E4E2" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "11%" >Step 1</TD><TD width = "40%"><a href="#" onClick="showDiv('targetAdd TestCase_1');return false;">Add</a></td><td><a href="#" onClick="showDiv('targetAdd TestCase_1ReqRes');return false;" size ="1">Request/Response</a>&emsp;&emsp;&emsp;1165ms</TD><td width="25%" align="center"><font color="green"><b>Passed</b></font></TD></TR></TABLE><div id="targetAdd TestCase_1" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#FFFAF0" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width="7%">Assertion</TD><TD width="40%">SOAP Response</TD><TD align="center" width="10%"><font color="green">Passed</font></TD><TD width="25%"></TD></TR></TABLE></div><div id="targetAdd TestCase_1ReqRes" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#AFEEEE" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "40%" size="4" valign="top"><font color="blue" size="2"><b>REQUEST</b></font><br><br><pre>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;tem:Add&gt;
         &lt;tem:intA&gt;15&lt;/tem:intA&gt;
         &lt;tem:intB&gt;13&lt;/tem:intB&gt;
      &lt;/tem:Add&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</pre></TD><TD width = "40%" size="4" valign="top" ><font color="blue" size="2"><b>RESPONSE</b></font><br><br><pre>&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;
   &lt;soap:Body&gt;
      &lt;AddResponse xmlns="http://tempuri.org/"&gt;
         &lt;AddResult&gt;28&lt;/AddResult&gt;
      &lt;/AddResponse&gt;
   &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt; </TD></TR></TABLE></div></div><TABLE align="center" ID="One" class= "class_name" bgcolor="#65C400" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "10%" align="center" ><font color="white">Divide TestCase</font></TD><TD width = "50%" onClick="showDiv('targetDivide TestCase');return false;" ><font color="white">Divide TestCase</font></td></TR></TABLE><div id="targetDivide TestCase" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#E5E4E2" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "11%" >Step 1</TD><TD width = "40%"><a href="#" onClick="showDiv('targetDivide TestCase_1');return false;">Divide</a></td><td><a href="#" onClick="showDiv('targetDivide TestCase_1ReqRes');return false;" size ="1">Request/Response</a>&emsp;&emsp;&emsp;477ms</TD><td width="25%" align="center"><font color="green"><b>Passed</b></font></TD></TR></TABLE><div id="targetDivide TestCase_1" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#FFFAF0" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width="7%">Assertion</TD><TD width="40%">SOAP Response</TD><TD align="center" width="10%"><font color="green">Passed</font></TD><TD width="25%"></TD></TR></TABLE></div><div id="targetDivide TestCase_1ReqRes" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#AFEEEE" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "40%" size="4" valign="top"><font color="blue" size="2"><b>REQUEST</b></font><br><br><pre>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;tem:Divide&gt;
         &lt;tem:intA&gt;15&lt;/tem:intA&gt;
         &lt;tem:intB&gt;3&lt;/tem:intB&gt;
      &lt;/tem:Divide&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</pre></TD><TD width = "40%" size="4" valign="top" ><font color="blue" size="2"><b>RESPONSE</b></font><br><br><pre>&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;
   &lt;soap:Body&gt;
      &lt;DivideResponse xmlns="http://tempuri.org/"&gt;
         &lt;DivideResult&gt;5&lt;/DivideResult&gt;
      &lt;/DivideResponse&gt;
   &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt; </TD></TR></TABLE></div></div><TABLE align="center" ID="One" class= "class_name" bgcolor="#65C400" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "10%" align="center" ><font color="white">Multiply TestCase</font></TD><TD width = "50%" onClick="showDiv('targetMultiply TestCase');return false;" ><font color="white">Multiply TestCase</font></td></TR></TABLE><div id="targetMultiply TestCase" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#E5E4E2" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "11%" >Step 1</TD><TD width = "40%"><a href="#" onClick="showDiv('targetMultiply TestCase_1');return false;">Multiply</a></td><td><a href="#" onClick="showDiv('targetMultiply TestCase_1ReqRes');return false;" size ="1">Request/Response</a>&emsp;&emsp;&emsp;322ms</TD><td width="25%" align="center"><font color="green"><b>Passed</b></font></TD></TR></TABLE><div id="targetMultiply TestCase_1" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#FFFAF0" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width="7%">Assertion</TD><TD width="40%">SOAP Response</TD><TD align="center" width="10%"><font color="green">Passed</font></TD><TD width="25%"></TD></TR></TABLE></div><div id="targetMultiply TestCase_1ReqRes" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#AFEEEE" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "40%" size="4" valign="top"><font color="blue" size="2"><b>REQUEST</b></font><br><br><pre>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;tem:Multiply&gt;
         &lt;tem:intA&gt;5&lt;/tem:intA&gt;
         &lt;tem:intB&gt;5&lt;/tem:intB&gt;
      &lt;/tem:Multiply&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</pre></TD><TD width = "40%" size="4" valign="top" ><font color="blue" size="2"><b>RESPONSE</b></font><br><br><pre>&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;
   &lt;soap:Body&gt;
      &lt;MultiplyResponse xmlns="http://tempuri.org/"&gt;
         &lt;MultiplyResult&gt;25&lt;/MultiplyResult&gt;
      &lt;/MultiplyResponse&gt;
   &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt; </TD></TR></TABLE></div></div><TABLE align="center" ID="One" class= "class_name" bgcolor="#65C400" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "10%" align="center" ><font color="white">Subtract TestCase</font></TD><TD width = "50%" onClick="showDiv('targetSubtract TestCase');return false;" ><font color="white">Subtract TestCase</font></td></TR></TABLE><div id="targetSubtract TestCase" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#E5E4E2" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "11%" >Step 1</TD><TD width = "40%"><a href="#" onClick="showDiv('targetSubtract TestCase_1');return false;">Subtract</a></td><td><a href="#" onClick="showDiv('targetSubtract TestCase_1ReqRes');return false;" size ="1">Request/Response</a>&emsp;&emsp;&emsp;343ms</TD><td width="25%" align="center"><font color="green"><b>Passed</b></font></TD></TR></TABLE><div id="targetSubtract TestCase_1" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#FFFAF0" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width="7%">Assertion</TD><TD width="40%">SOAP Response</TD><TD align="center" width="10%"><font color="green">Passed</font></TD><TD width="25%"></TD></TR></TABLE></div><div id="targetSubtract TestCase_1ReqRes" style="display:none"><TABLE align="center" ID="One" class= "class_name" bgcolor="#AFEEEE" border width ="80%"  cellspacing = 0 cellpadding = 2  style = "border-left:solid 2px White;"><TR><TD width = "40%" size="4" valign="top"><font color="blue" size="2"><b>REQUEST</b></font><br><br><pre>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"&gt;
   &lt;soapenv:Header/&gt;
   &lt;soapenv:Body&gt;
      &lt;tem:Subtract&gt;
         &lt;tem:intA&gt;50&lt;/tem:intA&gt;
         &lt;tem:intB&gt;25&lt;/tem:intB&gt;
      &lt;/tem:Subtract&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</pre></TD><TD width = "40%" size="4" valign="top" ><font color="blue" size="2"><b>RESPONSE</b></font><br><br><pre>&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;
   &lt;soap:Body&gt;
      &lt;SubtractResponse xmlns="http://tempuri.org/"&gt;
         &lt;SubtractResult&gt;25&lt;/SubtractResult&gt;
      &lt;/SubtractResponse&gt;
   &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt; </TD></TR></TABLE></div></div></body></html>